//
//  main.m
//  SchoolNewsData
//
//  Created by 宋开开 on 2022/4/17.
//

#import <Foundation/Foundation.h>

int main(int argc, const char * argv[]) {
    @autoreleasepool {
        // insert code here...
        NSArray *schoolNews = @[
            @{@"title" : @"国际物流与跨境电商项目班招生简章",
              @"text" : @"  为了深入贯彻落实教育部《关于加快建设高水平本科教育全面提高人才培养能力的意见》、《现代产业学院建设指南（试行）》等文件精神，2021年7月重庆邮电大学与重庆国际物流枢纽园区共同申报“重庆国际物流与跨境电商产业学院”并获批为重庆市示范性现代产业学院，具体依托重庆邮电大学现代邮政学院进行建设。为高水平推进重庆国际物流与跨境电商产业学院建设，加快高素质创新型人才培养，学校研究决定，特设立“国际物流与跨境电商项目实验班”，并面向全校21级理工类学生（按高考招生时分类）开展招生。一、培养目标“国际物流与跨境电商项目实验班”围绕德智体美劳全面发展，培养具有全球视野，具备扎实的管理学、经济学、信息科学基础知识，熟悉数字经济时代国际商贸活动规律，掌握国际物流与跨境电商知识与理论，熟悉数字化、智能化技术，能够在企事业从事国际物流与跨境电商相关的经营决策、运营管理、系统设计和标准制定等工作，成为国际物流与跨境电商领域数字化管理的高素质创新型人才。所属专业：物流管理 专业代码：120601 授予学位：管理学 基本学制： 4年 二、招生与选拔（1）招生。按照自愿原则，“国际物流与跨境电商项目实验班”面向全校理工类2021级学生招生30人。（2）选拔。由学院组织专家组进行面试，考察学生的学习成绩、专业认知、组织管理能力、创新创业精神等综合素质，面试成绩由专家组评分确定。三、培养特色（1）独立班管理。“国际物流与跨境电商项目班”单独制定培养方案，采取独立班管理方式，派遣重庆国际物流与跨境电商产业学院具有丰富理论和实践经验的优秀老师担任班主任。（2）双导师指导。为每个学生配备双导师，其中，一名为校内导师，一名为校外导师。校内导师由理论造诣较高、教学经验丰富的本校教师担任，校外导师由重庆市国际物流枢纽园区内国际物流与跨境电商企业中高层管理者担任。（3）名师授课。授课教师由本校优秀教师、企业管理精英组成。本校教师在全校范围内择优选任，同时聘请一批管理经验丰富的企业界人士参与培养。（4）与管理精英零距离接触。学生除与担任课程教学的管理界人士面对面外，还将更多地获得与企业高管、创业精英零距离接触的机会。（5）强化实训与实践。与重庆市国际物流枢纽园区共建校外实习实践基地，有计划地送学生到相关国际物流与跨境电商企业开展实地锻炼，增强学生实习实践和创新创业能力，强化学生综合素质。（6）拓展就业渠道。依托重庆市国际物流枢纽园区内4000余家企业资源，通过“国际物流与跨境电商项目实验班”学习，熟悉产业发展，具备创新能力，拓展就业渠道和提升就业质量。四、时间安排（1）宣讲 2022年4月25日（周一）16：00-18:00，3教3108（2）报名 报名时间：2022年4月15日---4月29日 报名方式：下载附件报名表，电子邮箱发 fudq@cqupt.edu.cn或纸质报名表填写交至现代邮政学院综合办公室2706张亮老师（地址：留学生综合楼7楼2706室）。（3）咨询 咨询QQ群：949886982 咨询老师：付德强（15023778878）、李诗杨（15086969601）"
            },
            @{@"title" : @"关于2022-2023学年第一学期教学任务填报的通知",
              @"text" : @"  各教学单位：2022-2023学年第一学期教学任务开始填报，现将相关事宜做如下说明：一、20221学期教学任务公布已公布在教务在线上，请进入“教学管理”，选择“教学任务管理”查看，请各学院认真核查所属课程（学时/学分、课程性质、是否本教学部承担、开设学期等）。并于第7周周五（4月15日）至第8周周五（4月22日）12点前完成网上填报（2022级教学任务待招生计划确定后公布）。二、网络填报：登陆 “教务在线”（jwzx.cqupt.edu.cn）网站，登录个人服务，从教学管理中进入教学任务管理。三、填报完毕后通过教务在线打印纸质文档由教学部(中心)主任及学院领导签字后交教务处存档备案（请各学院注意核查任课教师资格）。四、填报要求：本次教学任务填报包含了培养方案中本学期开设的所有理论、实验、实践环节课程、交叉通识课/人文素质课及理论实验同排课程，填报要求如下：（一）理论课程：1. 理论课程填报基本要求：完成教学合班、确认任课教师、设定上课周次信息。多教师分段完成教学任务的，务必标注清楚每个老师执行的具体教学周。2.理论实验同排课程：任务填报时，合班类型选择“理论实验同排”，并在备注中说明。3.交叉通识课/人文素质课：根据学校培养方案指导意见，所有交叉通识课/人文素质课为每学期滚动开出，请课程承担学院完成本学期可开出班级数、每班容纳人数，任课教师的填报确认。注：同一理论课程有两位教师共同承担的请在教学任务书上说明；总学时为32学时的课程可根据课程接续情况或教师需求，安排前后半学期集中行课（即1-8周/9-16周分别开设32学时课程一门），安排时请务必考虑到学生整个学期课程的均衡，并在上报任务书中详细说明。（二）实验课程：1. 实验课程填报基本要求：随课实验、独立实验、实训周学时最多安排4学时,合班人数应充分考虑实验室容量、设备台套数及重修补修学生等情况，两个及以上自然班合班的课程应安排两名教师（主讲和辅导）。多教师分段完成教学任务的，务必标注清楚每个老师执行的具体教学周。2.集中进行的实践环节：合班人数应充分考虑实验室容量、设备台套数及重修补修学生等情况，确定任课教师（两个及以上自然班合班的课程应安排两名教师（主讲和辅导））、确认停课周次；金工实习、电装实习和艺术写生实习按40 学时/周排课，其他集中实习按20学时/周排课；时间应集中安排在1-3周或16-18周。3.分散进行的实验及实践环节课程：实验及实践环节课程原则上不采用分散组织形式。如确需分散进行，需在任务填报时合班类型选择“分散”（教学班合班编号为SF），并备注为“分散进行”，同时将课程具体安排方式（时间、地点、任课教师）报送至实践科备案。学院应加强课程过程指导和管理，确保课程质量。4.实验室课程预安排：10周前，务必请实验课程承担单位，在准确填报教学任务的基础上，对实验室进行排课预安排规划，设置在该实验室进行授课的教学班、上课周次、周学时信息，教务处将以此为排课依据。（操作帮助见附件7）五、填报过程中如有疑问请及时联系反馈。理论任务安排：62461387，62487854 实验实践任务安排：62487773，62487849 网络填报操作：62486877，62460703"
            },
            @{@"title" : @"关于开展2022-2023学年第一学期教材选用信息采集的通知",
              @"text" :
                  @"  各学院：根据《重庆邮电大学教材管理实施细则》(重邮〔2020〕201号)文件精神,为做好2022-2023学年第一学期教材选用与征订工作，现将有关事项通知如下：一、教材填报方式、时间及流程：1.教材选用信息采集实行网上填报的方式。2.网上填报系统开放时间：第七周周五（4月15日）16：00—第九周周三（4月27日）12：00，请各学院高度重视，务必在第9周周三（4月27日）12：00前在网上填报完毕。3.为防止出现错订、漏订或重复征订，所有课程（含全校选修课程）教材由教学系、部、中心负责人组织任课教师商讨拟定，经学院审核通过后由教学系、部、中心负责人使用自己的账号和密码通过教务在线/网上业务办理快速入口/教材征订进入网上填报系统统一填报教材信息,填报完毕后从网上打印相关报表,完善相关签字后报送教务处教研科。注意：请先填报交叉通识课的教学任务，再进行教材征订。请各学院填报完毕后务必认真核查，如发生错订、漏订或重复征订，一经查实，将由相关学院自行承担责任！二、教材选用及填报注意事项：1.各学院应严格按照中宣部、教育部以及学校有关文件要求，对所有选用的教材（包含正式出版教材、自编讲义、原版引进教材等）进行政治立场、价值导向、意识形态等方面的审查，严把政治关。思想政治理论课必须统一使用国家统编教材。各哲学社会科学学科相关专业开设的专业课程必须统一使用马克思主义理论研究和建设工程重点教材。公共基础必修课程、学科专业核心课程教材应在国家公布的教材目录内优先选用，引进教材要严格遵守国家出版物进口管理的有关规定。2.坚持凡选必审的原则。所有选用教材由教学系、部、中心负责人组织任课教师商讨拟定后，必须经学院分管教学工作的院领导以及学院党组织书记从学术性和思想性两方面进行全面审核，严把政治关和学术关。未经审核或审核未通过的教材不得进入课堂教学环节。3.为避免出现征订教材绝版而订购不到等情况，请任课老师尽量挑选教材征订系统目录内最新版本教材，若选目录外教材，请务必根据实际教材认真填写并逐项核对各信息，同时通过出版社、网上、书店等途径了解是否有书购买，确保征订教材学生能购买到。4.同一专业的同一门课程由多名教师授课的，经课程组协商后只能填报同一种教材。5.若课程承担学院和学生所在学院为两个不同的单位，则两个相关学院务必在网上填报教材信息前就课程要求和选用教材达成一致。特别是要求采用双语教学、使用英文教材的课程。6.征订教材原则上只填报下学期开设课程的教材，不得提前征订非下学期课程教材；如果存在下学期教材已经面向相同学生在以前学期征订过（包括同一本教材连续两个学期使用），请在“不订教材原因”中选择“上学期已订”。7.如课程不征订教材，请征订教师务必选择相应原因。8.由于在学生选课同时将开放课程对应教材查询以方便学生提前购买教材，故网上征订关闭后，原则上不得再进行教材改订，请各学院务必严格按照规定时间慎重选订教材。三、教材选用信息采集表报送时间和要求请各学院务必于第九周周三（4月27日）12：00前将网上打印的《重庆邮电大学2022－2023学年第一学期教材选用信息采集表》（一式两份）经教学系、部、中心负责人签字，学院分管教学工作的院领导及学院党组织书记共同审核签字，并由学院汇总加盖公章后报送教务处教学运行科（四教201办公室）。请教学系、部、中心负责人、学院分管领导以及党组织书记务必认真审核后签字盖章。四、其他事项1.学校划拨教师教学用书费用到相关教学单位，由各教学单位自行组织征订相应的教师教学用书（含教参）。2.教材是学生学习的主要参考资料，选用教材应广泛听取任课教师意见，同时学院应在教师中强调教材信息网上填报及教材选用质量的重要性，力保教材征订的规范性、严谨性以及教材信息填报数据的准确性，选用和征订能紧扣授课内容的优秀教材（教育部国家级规划教材及精品教材、省部级规划教材及精品教材等）。严禁任课教师授课时不使用或极少使用所征订教材，甚至要求学生另行购买其他教材。若出现上述情况，一经查实，学校将严肃处理并追究相应教师和学院责任！希望各学院务必高度重视教材的选用和征订！3.由于假期中可能涉及部分教材回告，为确保教材能在行课前及时到位，请各学院务必在假期中安排专门教师按时按要求处理回告相关事宜。由于学生是通过网络了解课程教材并据此购买，因此如果选用教材信息发生变化（包括换新版以及更换教材），请相关学院务必在反馈回告同时在网上重新填报新教材信息。如有疑问，请电话联系62487854。"
            },
            @{@"title" : @"关于2022年校运动会安排调整的通知",
              @"text" :
                  @"  各教学单位：根据学校最新安排，第七周周五、周六的运动会因天气原因延期开展，具体安排请见后续通知。本周五、周六（4月15日、16日）按照课表安排正常行课，请各学院务必通知到所有的老师和学生。"
            },
            @{@"title" : @"关于公布2022年重庆邮电大学电子商务“创新、创意及创业”挑战赛获奖名单的通知",
              @"text" :
                  @"  各学院、各相关单位：由重庆邮电大学教务处主办，现代邮政学院承办的2022年重庆邮电大学电子商务“创新、创意及创业”挑战赛（以下简称电子商务“三创”赛）已于2022年4月9日圆满结束。竞赛工作自2021年12月启动以来，各学院认真组织、全力备战，共有108支具备参赛资格的团队在官方网站报名参赛。经聘请电子商务领域、科创领域的专家组成评审委员会，严格按照电子商务“三创”赛评审基本原则、评审程序和评审标准，经过初赛（通信评审）、复赛（路演答辩）环节，评选出行板如歌、智水云控等4支团队获得特等奖，Mamiu小队、国“太”民安——太赫兹安检仪等12支团队获得一等奖，舆情挖掘机、慧安通运团队等22支团队获得二等奖，咱就是说队、神奇海LUO等32支团队获得三等奖。希望各学院以2022年学校电子商务“三创”赛工作为契机，全面开展创新创业创优工作，结合高校人才培养模式和方法，给更多大学生提供创新创业平台，提供有力支持，切实为大学生成长成才服务。"
            },
            @{@"title" : @"2022年校运动会安排的通知",
              @"text" :
                  @"  各教学单位：根据校办本周工作安排，2022年春季运动会时间为四月十五、十六日（第七周周五、周六）。四月十四日（第七周周四）正常行课。若因天气或其他特殊原因造成运动会无法正常进行，四月十五、十六日按照课表安排正常行课。"
            },
            @{@"title" : @"关于领取第十六届田径运动会秩序册的通知",
              @"text" :
                  @"  各参赛代表队：第十六届田径运动会秩序册已印制完毕,请各参赛代表队于2022年4月14日上午9:00-17:30到体育学院大学体育教学研究部（体育学院二楼208）领取。"
            },
            @{@"title" : @"关于招募2022-2023年电子设计竞赛指导教师的通知",
              @"text" :
                  @"  各学院、各相关单位：根据《重庆邮电大学本科学生学科竞赛工作组织实施方案》及配套文件精神，为加强我校创新创业教育体系，增强师资队伍的创新创业能力，结合学院承办的重点赛事，依托本科学生创新与学科竞赛训练基地，现组织开展2022-2023年电子设计竞赛指导教师招募工作。相关事宜如下： 一、招募内容 组建2022-2023年电子设计竞赛教师指导团队，完成2022-2023年各级电子设计竞赛的组织、培训和指导工作，包括： 2022年全国大学生电子设计竞赛系列邀请赛、2022年重庆市大学生电子设计竞赛、2023年全国大学生电子设计竞赛以及相关校级选拔赛，二、招募对象 指导教师申请条件在满足《重庆邮电大学本科学生学科竞赛指导教师及团队建设办法》的基础上，还需至少满足以下其中一条要求：（一）近五年（2017年-2021年）作为第一指导教师指导学生参加省甲及以上级别电子类竞赛并获奖（不包含优胜奖）。（二）具有丰富的相关工程背景。三、招募要求（一）要求指导教师积极承担竞赛的组织、培训工作，包括日常培训、寒暑期集训、讲座、比赛出题、作品测试、竞赛研讨、培训课程建设等等。每年团队将对指导教师的工作进行考核。（二）请有意愿加入的老师填写申请表，并于2022年4月20日18:00之前将申请表电子档发至yingjun@cqupt.edu.cn，后续我们将公布入选名单。期待您的加入！"
            },
            @{@"title" : @"关于组织2022年本科教育教学改革研究项目立项申报工作的通知",
              @"text" :
                  @"  各学院，各相关单位：  为推进本科教育高质量发展，深化教育教学改革，提升学校教学质量和水平，培育教育教学成果，根据《重庆邮电大学教育教学改革项目管理办法》（教务处〔2017〕3号）文件精神，决定开展2022年校级本科教育教学改革研究项目立项申报工作。现将有关事项通知如下：  一、立项原则  1.项目符合高等教育教学发展规律，对提高人才培养质量具有积极作用，能为高等教育教学改革、教学建设和教学管理提供理论依据和实践经验；2.项目方案立意新颖，论证充分，目标明确，计划切实可行，实施方法科学，经费预算合理，具备完成项目任务的基本条件；3.项目注重现有成果的应用，具有继承性、前瞻性和可操作性，使教育教学改革呈现循序渐进，不断深化的态势，预期能取得明显的改革成果，并具有使用和推广价值；4.项目应注重实践，密切围绕学校本科教学体系建设，强调研究成果的应用，使广大学生受益。二、项目类别与组织方式  根据学校办学定位及培养目标，结合教学工作实际，围绕新工科和新文科、思政课程与课程思政、体育与美育改革、一流专业、一流课程、新型产业学院、教育评价、智慧教育、人工智能+教育等当前教育教学改革中的重点、热点、难点问题开展研究。（一）项目类别2022年校级教改分为重点项目和一般项目。根据工作需要设置思政课程与课程思政专项，新工科与新文科建设专项，体育、美育和劳动教育改革专项，合计约占立项总数的40%。（二）组织方式根据学校总体安排，本年度校级教改采取公开招标和限额推荐的方式进行。1.公开招标项目。在全校范围内开展7个指定选题的公开招标项目申报（具体名称和要求见附件1），择优立项为校级教改重点项目，不占学院推荐名额。2.根据指南自拟选题项目。请各学院参照《重庆邮电大学2022年校级教育教学改革项目选题指南》（见附件2）有针对性地开展教学研究和改革，自行命题、自行组织申报及评审工作，并根据学校分配名额（具体名额见后续邮件通知）择优推荐立项为校级教改重点或一般项目，其中重点项目不超过本学院分配名额的40%。三、申报要求和条件1.具有中级及其以上职称或具有研究生学历的我校在职人员；2.有在研教育教学改革项目的项目负责人不再申报；3.项目负责人不得同时申请两个及其以上的教改项目；4.项目主要研究人员参研教改项目不得超过两项。四、报送材料及时间要求1.请申报人于5月5日前，登录“教务在线-教学项目申请”端口完成网上申报，填写并报送《重庆邮电大学教育教学改革项目申请书》（附件3）一式两份（纸质），项目申请书中涉及到的论文、教材及教研、科研、获奖情况等附件材料装订成册，留学院备查。2.《2022年度校级教育教学改革项目申报汇总表》（“教务在线”下载打印，以学院为单位汇总）一式一份（纸质）。3.上述所有纸质版申报材料均以学院为单位汇总并由分管教学院长签字，学院盖章后，于5月5日前统一报送至教务处教学研究与建设科，逾期不予受理。联系人：黄秋实；联系电话：62461394"
            },
            @{@"title" : @"关于组织参加第八届东方财富杯全国大学生金融挑战赛的通知",
              @"text" :
                  @"  各学院：为加强对大学生的金融实践教育，帮助大学生掌握金融基础知识，增强金融安全意识，完善就业创业素质；团中央、东方财富信息股份有限公司和全国学校共青团研究中心联合举办了第八届“东方财富杯”全国大学生金融精英挑战赛，相关事宜通知如下。一、机构介绍  主办单位：共青团中央青年发展部  承办单位：东方财富信息股份有限公司全国学校共青团研究中心二、参赛要求（一）参赛对象  重庆邮电大学在校全日制本科（二）报名方式  报名方式一：手机APP报名  下载“东方财富”APP，首页点击左上角“头像”图标进入“我”页面，选择“金融挑战赛”报名参赛。报名方式二：微信报名  关注微信公众号“金融挑战赛”，点击“大赛”-“大赛报名”栏目获取报名链接。报名方式三：官网报名  每个参赛学校设一名领队老师，由领队老师负责组织收集参赛学生填写的报名表。1)学生到大赛官网下载并填写报名表后，提交给领队老师。2)领队老师汇总学生报名信息，上传至领队后台。3)学生下载 “东方财富”APP，使用报名手机号注册并登录，完成报名信息的确认。大赛官网：young.eastmoney.com（三）报名时间：报名：即日起至2022年5月17日  热身赛(个人赛)：2022年3月28日—2022年4月22日(周期4周)  校赛(个人赛)：2022年4月25日——2022年5月20日(周期4周)  省赛(团队赛)：2022年5月30日——2022年6月24日(周期4周)  国赛(团队赛)：2022年7月4日——2022年7月29日(周期4周)  三、竞赛说明与奖项设置  （一）竞赛说明  第八届“东方财富杯”全国大学生金融挑战赛，分为校赛、省赛和国赛三个阶段，参赛学生及团队使用大赛专用平台“东方财富”APP进行模拟交易。1.校赛  比赛形式为个人赛，进行模拟交易；各校综合收益率排名前30%的学生进入省赛。2.省赛  比赛形式为团队赛，参赛团队由晋级省赛的学生担任操盘手，邀请同校学生作为策略师、风控师组建团队，被邀请人可以是未报名参赛的学生，也可以是在校赛未晋级的学生，晋级学生之间也可以相互邀请；每个团队需设一名指导老师，参赛者仅限参加一个团队；每省(自治区、直辖市)综合收益率排名前20%的团队进入国赛；单周全国综合收益冠军团队直接进入国赛。2.国赛  比赛形式为团队赛，团队成员为省赛晋级原班人马，无需重新组队，按综合收益率排名评比出冠亚季军团队。（二）奖项设置  国赛冠军团队奖励30000元及证书；国赛亚军团队奖励20000元及证书；国赛季军团队奖励10000元及证书；国赛排名前300名的团队获一等奖证书，国赛排名第301至1300名的团队获二等奖证书，国赛排名第1301至3000名的团队获三等奖证书。省赛排名前5%的团队获省赛一等奖证书，省赛排名前5%-前15%的团队获省赛二等奖证书，省赛排名前15%-前30%的团队获省赛三等奖证书，省赛由东方财富颁发电子证书。省赛及国赛阶段，策略师和风控师按照要求分别定期提交策略报告和风控报告，由大赛组委会评选最佳策略师和最佳风控师各1名，分别奖励10000元及证书。四、 联系方式  请各参赛队提前加入QQ群并关注群内信息。（一）重邮东方财富杯官方一群: 542392634（二）重邮东方财富杯官方二群: 1015384091"
            },
            @{@"title" : @"第十六届田径运动会秩序册公示",
              @"text" :
                  @"  各学院、各部门工会：第十六届田径运动会秩序册编排已完成，现进行公示。请各学院、各部门工会认真查看运动员申报项目、姓名及单位是否正确，如有疑问请在2022年4月6日17：00之前联系体育学院。学生项目：易军老师，联系电话13594250307 教工项目：贺波老师，联系电话15086628813"
            },
            @{@"title" : @"关于核查2022-2023学年教学计划兼任务的通知",
              @"text" :
                  @"  各学院：根据本学期教学安排，请通过“教务在线-个人服务-教学任务管理-培养方案执行计划核对”对2022-2023学年教学计划兼任务进行核查，请按照年级专业培养方案仔细核对。温馨提示：1.核对内容：请确认专业信息、课程名称、课程类别、理论学时、实验学时、学分、开设学期、承担课程教学部是否有误；2.实践环节安排在课余和假期的需专门注明；3.如有开设二专业，请开设学院单独报送教学计划；4.核对完成后，请各学院最晚于第6周周五（4月8日）17：00前将由教学院长签字、盖章后的纸质文档交至教学运行科备案。"
            },
            @{@"title" : @"关于组织2022年重庆邮电大学电子设计竞赛的通知",
              @"text" :
                  @"  各学院：为进一步加强我校学生实践创新能力、团队协作能力，进一步加强学生动手能力和工程实践能力，提高学生针对实际问题进行电子设计、制作的综合能力，学校组织本次校级电子设计竞赛暨重庆市大学生电子设计竞赛选拔赛，相关事宜通知如下。一、组织机构 主办单位：教务处 承办单位：光电工程学院/重庆国际半导体学院 二、竞赛报名时间 2022年4月2日8:00至4月7日17:00。三、参赛对象 我校大一、大二和大三全日制本科学生。学生可跨年级、跨专业自由组队。要求3人一组，每组少于或者多于3人将视为无效报名；一人只能参加一组，不可参与多组，否则视为无效报名。校赛由学生自行完成参赛内容，无指导老师。四、竞赛说明（一）竞赛形式及赛题：本次比赛分为基本技能和综合项目两个赛道。1.基本技能赛道：只有大一年级队（3人均为大一）可报名参加本赛道，本次本赛道的比赛内容：在规定时间内用立创EDA软件完成指定电路的原理图及PCB板绘制和设计，题目将在比赛时由组委会发布，建议大家提前熟悉开发软件、器件封装、布局布线规则、51单片机最小系统等内容。2.综合项目赛道：本赛道赛题题目如附件，共3道赛 ???题，要求每组自行选择完成其中一道题。每个题目都有相应的评分标准，成绩按满分100分折算。（一）竞赛时间：1.基本技能赛道： 4月中下旬，具体时间后续发布，请关注QQ群。2.综合项目赛道： 4月2日8:00至5月12日17:00（二）纸质报告提交 综合项目赛道，每个参赛队应针对对应赛题完成一份报告，报告内容和格式参考全国大学生电子设计竞赛报告要求。报告提交方式请关注QQ群消息。五、竞赛报名方式 请登录我校教务在线“学生科技竞赛公共管理平台”网站（https://xkjs.cqupt.edu.cn）完成报名。报名请选择对应赛道的名称，请勿选错。六、评审及奖项设置（一）由我校电子设计竞赛教练团队组织教师进行测评与评奖。综合项目赛道评审时间和地点将于5月13日通过QQ群发布。（二）比赛设置一等奖、二等奖、三等奖和成功参赛奖，获奖队伍数量根据参赛人数和作品完成情况确定。获奖结果将在教务在线上发布。（三）基本技能赛道获奖学生可优先获得进入电子技术创新大本营的机会；综合项目赛道获奖学生可优先获得2022年重庆市大学生电子设计竞赛经费资助。七、联系方式 请各参赛队提前加入QQ群并关注群内信息。（一）基本技能赛道, QQ群号：981452208（二）综合项目赛道，QQ群号：924907050 八、其它注意事项 参赛作品不得有抄袭、剽窃等侵害他人知识产权的违法行为，如有违规者，则组委会有权取消其参赛获奖资格。"
            },
            @{@"title" : @"关于举办重庆邮电大学2022年中国大学生计算机设计大赛校级选拔赛的通知",
              @"text" :
                  @"  各学院：为进一步检查落实《高等学校计算机基础教学发展战略研究报告暨计算机基础课程教学基本要求》、《高等学校文科类专业大学计算机教学要求》，继续推动计算机教学改革，切实提高计算机教学质量，激励高校本科各门类学科专业学生学习计算机知识和技能的兴趣和潜能，培养其创新能力及团队合作意识，运用信息技术解决实际问题的综合实践能力，以提高其综合素质，造就更多的德智体美全面发展、创新型、实用型、复合型人才。同时也为了鼓励更多的学院参加比赛，向全国大赛推出高水平的参赛作品，学校决定举办重庆邮电大学2022年中国大学生计算机设计大赛校级选拔赛。现将有关事项通知如下：一、组织机构 主办单位：教务处 承办单位：计算机科学与技术学院 二、参赛要求（一）参赛对象 重庆邮电大学在校全日制本科（二）组队方式 校赛只接受参赛队为单位报名，每队设指导教师1～2名，每队名成员人数按照国赛类别要求组成（必须为同一所学校的在校生）。（三）报名 在学生科技竞赛公共管理平台上报名，报名成功后务必加赛事QQ群（群号：190819853），以便及时了解公布参赛成绩和后续事项。（一）报名截止时间：2022年4月30日24:00前。（二）学生科技竞赛公共管理平台登录方式：登录服务大厅→学生科技竞赛公共管理平台。（三）同时将作品打包，压缩包命名为：学院+作品名称+指导老师姓名，发送到指定邮箱：bigdata_cqupt@163.com。作品的具体提交内容以国赛报名平台（https://2022.jsjds.com.cn/）的要求为准，同时必须提供一个10分钟以内的作品讲解视频（.mp4 格式）。四、竞赛内容与奖项设置（一）竞赛内容 大赛作品分设软件应用与开发、微课与教学辅助、物联网应用、大数据应用、人工智能应用、信息可视化设计、数媒静态设计（普通组）、数媒静态设计专业组、数媒动漫与短片（普通组）、数媒动漫与短片专业组、数媒游戏与交互设计（普通组）、数媒游戏与交互设计专业组、国际生“学汉语，写汉字”等13个大类。具体作品内容分类说明详见国赛通知（https://www.jsjds.com.cn）。（二）奖项设置 校赛只设单项奖，单项奖设一等奖、二等奖和三等奖各若干项，其中本科生获得一等奖，依照各类别评审排序结果推荐参加2022年中国大学生计算机设计大赛重庆市级赛。五、评审标准 作品评审由评审委员会根据8个方面打分：①是否符合主题；②有无政治问题；③是否所属该大类；④内容有无剽窃；⑤是否参加其他大赛；⑥是否有创意；方法技术是否新颖；⑦讲解重点是否突出及演示是否超时；⑧效果。最终成绩提交组织委员会审核，并公布每个类别作品获奖等级。在组织校级预赛的基础上，推荐优秀作品参加市级比赛。"
            },
            @{@"title" : @"关于组织参加2022年“外研社杯”全国大学生英语演讲大赛校内选拔赛的通知",
              @"text" :
                  @"  为培养学生的英语学习兴趣，提高英语演讲能力，为学生提供一个展现风采、增强信心的舞台，特举办2022年“外研社杯”全国大学生英语演讲大赛重庆邮电大学校内选拔赛，现将相关事宜通知如下：一、组织单位 主办单位：教务处 承办单位：外国语学院 二、参赛对象 重庆邮电大学全日制在校本科生 三、报名方式 在学生科技竞赛公共管理平台上报名，报名成功后务必加赛事QQ群（群号：926050568），以便及时了解公布赛事分组和参赛成绩。（一）报名截止时间：2022年4月15日（周五）12:00（二）学生科技竞赛公共管理平台登录方式：登录服务大厅→学生科技竞赛公共管理平台。四、初赛时间、地点 时间：2022年4月18日（星期一）16:00 地点：第五教学楼5300 五、比赛方式（一）参赛形式 1.初赛：自由演讲及评委提问。参赛者以个人的形式参加，自我介绍完毕进行演讲或朗诵，时间为2分钟以内；评委提问1分钟。 2.决赛：根据组委会指定选题，分为命题演讲和即兴演讲两部分。评委根据演讲内容进行问答。（二）参赛主题 China's Wisdom for the World（主题视频连接附后）六、奖项设置 比赛设一等奖1名，二等奖2名，三等奖3名，所有获奖选手将获得由大赛组委会颁发的获奖证书。七、其它说明 获奖选手将获得外国语学院资深教师培训机会，表现优异者将代表我校参加重庆市及全国赛区选拔比赛。八、本次大赛相关事项如有变动，由大赛组委会作出解释。大赛联系人：冯成江 联系电话：62461637 主题视频连接：https://www.fltrp.com/c/2022-03-22/510134.shtml"
            }
        ];
    //保存
//        BOOL flag = [schoolNews writeToFile:@"/Users/songjiaming/Documents/GitHub/NewApp/SchoolNewsData/schoolNews.plist" atomically:YES];
//        if (flag) {
//            NSLog(@"写入成功");
//        }
    }
    return 0;
}
